[К оглавлению](../../README.md)

## E. Поразрядная сортировка

Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt

Поразрядная сортировка является одним из видов сортировки, которые работают практически за линейное от размера сортируемого массива время. Такая скорость достигается за счет того, что эта сортировка использует внутреннюю структуру сортируемых объектов. Изначально этот алгоритм использовался для сортировки перфокарт. Первая его компьютерная реализация была создана в университете MIT Гарольдом Сьюардом (Harold Н. Seward). Опишем алгоритм подробнее. Пусть задан массив строк s1 , ..., si причём все строки имеют одинаковую длину m. Работа алгоритма состоит из m фаз. На i -ой фазе строки сортируются па i -ой с конца букве. Происходит это следующим образом. Будем, для простоты, в этой задаче рассматривать строки из цифр от 0 до 9. Для каждой цифры создается «корзина» («bucket»), после чего строки si распределяются по «корзинам» в соответствии с i-ой цифрой с конца. Строки, у которых i-ая с конца цифра равна j попадают в j-ую корзину (например, строка 123 на первой фазе попадет в третью корзину, на второй — во вторую, на третьей — в первую). После этого элементы извлекаются из корзин в порядке увеличения номера корзины. Таким образом, после первой фазы строки отсортированы по последней цифре, после двух фаз — по двум последним, ..., после m фаз — по всем. При важно, чтобы элементы в корзинах сохраняли тот же порядок, что и в исходном массиве (до начала этой фазы). Например, если массив до первой фазы имеет вид: 111, 112, 211, 311, то элементы по корзинам распределятся следующим образом: в первой корзине будет. 111, 211, 311, а второй: 112. Напишите программу, детально показывающую работу этого алгоритма на заданном массиве.

Формат ввода
Первая строка входного файла содержит целое число n (1 ≤ n ≤ 1000) . Последующие n строк содержат каждая по одной строке si . Длины всех si , одинаковы и не превосходят 20. Все si состоят только из цифр от 0 до 9.

Формат вывода
В выходной файл выведите исходный массив строк в, состояние «корзин» после распределения элементов по ним для каждой фазы и отсортированный массив. Следуйте формату, приведенному в примере.

```cpp
#include <cmath>
#include <iostream>
#include <string>
#include <vector>
using namespace std;

void print_s(int i, const vector<vector<string>>& array, int n) {
    int c_empty = 0, not_empty = 0;
    cout << "**********"
         << "\n";
    cout << "Phase " << i << "\n";
    for (int k = 0; k < 10; ++k) {
        cout << "Bucket " << k << ": ";
        for (int w = 0; w < n; ++w) {
            if (array[k][w] == "" && c_empty == 0 && w == 0) {
                cout << "empty";
                ++c_empty;

            } else if (array[k][w] != "") {
                if (not_empty != 0 && w < (n) && w != 0) {
                    cout << ", ";
                    ++c_empty;
                }
                cout << array[k][w];
                ++not_empty;
            }
        }
        cout << "\n";
        c_empty = 0;
        not_empty = 0;
    }
}
void sort(vector<string>& strings, int n, int len) {
    int phase = 0;

    for (int i = len - 1; i >= 0; --i) {
        ++phase;
        vector<vector<string>> array(10, vector<string>(n));
        int c1 = 0, c2 = 0, c3 = 0, c4 = 0, c5 = 0, c6 = 0, c7 = 0, c8 = 0, c9 = 0, c0 = 0;
        for (int r = 0; r < n; ++r) {
            switch (strings[r][i]) {
                case '0':
                    array[0][c0] = strings[r];
                    ++c0;
                    break;
                case '1':
                    array[1][c1] = strings[r];
                    ++c1;
                    break;
                case '2':
                    array[2][c2] = strings[r];
                    ++c2;
                    break;
                case '3':
                    array[3][c3] = strings[r];
                    ++c3;
                    break;
                case '4':
                    array[4][c4] = strings[r];
                    ++c4;
                    break;
                case '5':
                    array[5][c5] = strings[r];
                    ++c5;
                    break;
                case '6':
                    array[6][c6] = strings[r];
                    ++c6;
                    break;
                case '7':
                    array[7][c7] = strings[r];
                    ++c7;
                    break;
                case '8':
                    array[8][c8] = strings[r];
                    ++c8;
                    break;
                case '9':
                    array[9][c9] = strings[r];
                    ++c9;
                    break;

                default:
                    break;
            }
        }
        int count = 0;
        for (int m = 0; m < 10; ++m) {
            for (int q = 0; q < n; ++q) {
                if (array[m][q] != "") {
                    strings[count] = array[m][q];
                    ++count;
                }
            }
        }
        print_s(phase, array, n);
    }
}

int main() {
    int n;
    cin >> n;
    int len;
    vector<string> strings;

    string str;

    for (int i = 0; i < n; ++i) {
        cin >> str;

        strings.push_back(str);
    }
    len = str.length();
    cout << "Initial array:"
         << "\n";
    for (int i = 0; i < n; ++i) {
        cout << strings[i];
        if (i < n - 1) cout << ", ";
    }
    cout << "\n";

    sort(strings, n, len);
    cout << "**********"
         << "\n"
         << "Sorted array:"
         << "\n";
    for (int h = 0; h < n; ++h) {
        cout << strings[h];
        if (h < n - 1) cout << ", ";
    }
}
```