[К оглавлению](../../README.md)

### A. Не минимум на отрезке
Задана последовательность целых чисел a1, a2, …, an. Задаются запросы: сказать любой элемент последовательности на отрезке от L до R включительно, не равный минимуму на этом отрезке.

Формат ввода
В первой строке содержатся два целых числа N, 1 ≤ N ≤ 100 и M, 1 ≤ M ≤ 1000 — длина последовательности и количество запросов соответственно. Во второй строке — сама последовательность, 0 ≤ ai ≤ 1000. Начиная с третьей строки перечисляются M запросов, состоящих из границ отрезка L и R, где L, R - индексы массива, нумеруются с нуля.

Формат вывода
На каждый запрос выведите в отдельной строке ответ — любой элемент на [L, R], кроме минимального. В случае, если такого элемента нет, выведите "NOT FOUND".

```cpp
#include <iostream>

struct Zapros {
    int l = 0;
    int r = 0;
};

int main() {
    int n, m;
    int arr1[100];
    Zapros arr2[1000];

    std::cin >> n >> m;
    for (int i = 0; i < n; ++i) {
        std::cin >> arr1[i];
    }
    for (int i = 0; i < m; ++i) {
        std::cin >> arr2[i].l >> arr2[i].r;
    }
    for (int j = 0; j < m; ++j) {
        int min = arr1[arr2[j].l];
        for (int i = arr2[j].l; i <= arr2[j].r - 1; ++i) {
            if (arr1[i] > arr1[i + 1]) {
                min = arr1[i + 1];
            }
        }
        int count = 0, k = 0;
        for (int i = arr2[j].l; i <= arr2[j].r; ++i) {
            if (arr1[i] != min) {
                ++count;
                k = i;
                break;
            }
        }
        if (count != 0) {
            std::cout << arr1[k] << "\n";
        } else {
            std::cout << "NOT FOUND"
                      << "\n";
        }
    }
}
```