[К оглавлению](../../README.md)

## J. Групповой проект

Всего студентов по направлению «Мировая культура» — n человек. Преподаватель дал задание — групповой проект. Для выполнения этого задания студенты должны разбиться на группы численностью от a до b человек. Скажите, можно ли разбить всех студентов на группы для выполнения проекта или преподаватель что-то перепутал.

Формат ввода
В первой строке вводится число t (1 ≤ t ≤ 100) — количество тестовых случаев. Далее для каждого тестового случая вводится 3 целых числа n, a и b (1 ≤ n ≤ 109, 1 ≤ a ≤ b ≤ n) — общее число студентов и ограничение на число студентов в одной группе.

Формат вывода
Для каждого тестового случая выведите "YES", если можно разбить студентов на группы и "NO", если нельзя.

```cpp
#include <iostream>
#include <tuple>
#include <vector>
using namespace std;

int main() {
    int t;
    long n, a, b;

    cin >> t;
    vector<tuple<long, long, long>> arr;
    for (int i = 0; i < t; ++i) {
        cin >> n >> a >> b;
        arr.push_back(make_tuple(n, a, b));
    }

    for (int j = 0; j < t; ++j) {
        bool tmp = false;
        if (get<0>(arr[j]) % get<1>(arr[j]) <=
            (get<0>(arr[j]) / get<1>(arr[j])) * (get<2>(arr[j]) - get<1>(arr[j]))) {
            tmp = true;
        }
        if (tmp) {
            cout << "YES";
        } else {
            cout << "NO";
        }
        cout << "\n";
    }
}
```
