[К оглавлению](../../README.md)

## B. Затерянный мир

Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt

Территория зоопарка Юрского периода «Затерянный мир» представляет собой решётку N × N, в каждой клетке которой находится вольер для динозавра. Директор зоопарка Степан Савельев планирует расселить в зоопарке N динозавров. Вольеры отделены друг от друга невысоким забором. Сотрудникам зоопарка известно, что динозавр не покидает пределов своего вольера, и не ломает забор, если он не видит на территории парка других динозавров. Зрительный аппарат у динозавров таков, что он видит всех динозавров, которые находятся на одной строке, на одном столбце или на одной диагонали с ним. Если же динозавр видит другого ящера, то ломает забор и вступает в борьбу. Директор зоопарка не хочет терпеть убытки, поэтому просит вас посчитать количество способов так расселить динозавров в зоопарке, чтобы никакой ящер не видел остальных динозавров.

Формат ввода
Задано единственное число N (N ≤ 10).

Формат вывода
Необходимо вывести количество способов, которыми можно расселить в зоопарке N динозавров, чтобы у зоопарка не было убытков.

```cpp
#include <iostream>
#include <vector>
using namespace std;

int is_mat(vector<vector<int>>& arr, int raw, int column, int n) {
    for (int i = 0; i < raw; ++i) {
        if (arr[i][column] == 1) {
            return 0;
        }
    }
    for (int i = raw, j = column; i >= 0 && j >= 0; --i, --j) {
        if (arr[i][j] == 1) {
            return 0;
        }
    }
    for (int i = raw, j = column; i >= 0 && j < n; --i, ++j) {
        if (arr[i][j] == 1) {
            return 0;
        }
    }
    return 1;
}
int count_din(vector<vector<int>>& arr, int raw, int n, int& count) {
    if (raw == n) {
        ++count;
        return count;
    }
    for (int i = 0; i < n; ++i) {
        if (is_mat(arr, raw, i, n)) {
            arr[raw][i] = 1;
            count_din(arr, raw + 1, n, count);
            arr[raw][i] = 0;
        }
    }
    return count;
}
int main() {
    int n;
    int count = 0;
    cin >> n;
    vector<vector<int>> arr(n, vector<int>(n));

    int res = count_din(arr, 0, n, count);
    cout << res;
}
```